---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SystemNavigatorFailures.CannottFindCorrectTreeNode
source: html/d975ddcc-6f5f-edc6-ea89-009bb8e7d62c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SystemNavigatorFailures.CannottFindCorrectTreeNode Property

Can't find the correct tree node in system browser according to the node index.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannottFindCorrectTreeNode { get; }
```